DataProcessors/ЗаписьНаЗамер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ЗаписьНаЗамер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ГрафикВстречИЗамеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ГрафикВстречИЗамеров</Name>
			<Comment>График сотрудников(Замеры и встречи)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Занят</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Замер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Замер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГрафикВстречИЗамеров</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗамера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замерщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Километраж</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСпецификаций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаПришел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЗамер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Замер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЛице</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородРабочий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаНаРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамерыИВстречи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияПолейАдресПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияПолейАдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольИнкассатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСпецификаций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонРабочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доверенности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДоверенности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоверенности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаписьНаЗамер/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьТЗ();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПлан()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГрафикВстречИЗамеров.Период,
	|	ГрафикВстречИЗамеров.Сотрудник КАК Сотрудник,
	|	ГрафикВстречИЗамеров.Регистратор.АдресЗамера КАК АдресЗамера
	|ИЗ
	|	РегистрСведений.ГрафикВстречИЗамеров КАК ГрафикВстречИЗамеров
	|ГДЕ
	|	ГрафикВстречИЗамеров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ГрафикВстречИЗамеров.Подразделение = &Подразделение
	|	И ГрафикВстречИЗамеров.Сотрудник В(&СписокЗамерщиков)";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("СписокЗамерщиков", СписокЗамерщиков);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период));

	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	
	СекундВЧасе = 60 * 60;
	МассивЗамерщиков = СписокЗамерщиков.ВыгрузитьЗначения();
	
	ЭтаФорма.План.Очистить();
	Для Час = 9 По 18 Цикл
		НоваяСтрока = ЭтаФорма.План.Добавить();
		ПериодВремя = Период + Час * СекундВЧасе;
		НоваяСтрока.Время = ПериодВремя;
		Для ы = 0 по МассивЗамерщиков.Количество()-1 Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Период", ПериодВремя);
			Отбор.Вставить("Сотрудник", МассивЗамерщиков[ы]);
			ПоискСтроки = ТЗ.НайтиСтроки(Отбор);
			
			Если ПоискСтроки.Количество() = 1 Тогда
				НоваяСтрока["Замерщик"+Число(ы+1)] = ПоискСтроки[0].АдресЗамера;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	// если понадобится время после 18:00
	// добавлять обработку сюда
	
КонецФункции // ЗаполнитьПлан()

&НаСервере
Процедура ИнициализироватьТЗ()
	
	ОчиститьРеквизиты();
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивЗамерщиков = СписокЗамерщиков.ВыгрузитьЗначения();
	
	// добавим новый реквизит обработки, таблица значения с именем "План"
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("План", Новый ОписаниеТипов("ТаблицаЗначений")));
	// добавим новую колонку для таблицы значения
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Время", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Время)),"План" ,"Время"));
	
	// добавим колонки по количеству замерщиков
	Для ы = 1 По МассивЗамерщиков.Количество() Цикл
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Замерщик"+ы, Новый ОписаниеТипов("Строка"),"План"));
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	МассивДобавляемыхРеквизитов.Очистить();
	
	// добавляем элементы формы к созданным талице значения и колонкам
	ТаблицаФормы = Элементы.Добавить("План", Тип("ТаблицаФормы"));
	ТаблицаФормы.ПутьКДанным = "План";
	ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТаблицаФормы.ТолькоПросмотр = Истина;
	
	ДобавитьКолонку("План", "Время", "Время");
	Для ы = 1 По МассивЗамерщиков.Количество() Цикл
		ДобавитьКолонку("План", "Замерщик"+ы, МассивЗамерщиков[ы-1]);
	КонецЦикла;
	
	ЗаполнитьПлан();
	
	ТаблицаФормы.УстановитьДействие("Выбор", "ПланВыбор");
	
КонецПроцедуры // ИнициализироватьТЗ()

&НаКлиенте
Процедура ПланВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// вот так кривенько получаем значение ячейки по которой ткнули мышей
	ИмяКолонки = СтрЗаменить(Поле.Имя, "План", "");
	ЗначениеЯчейки = Элементы.План.ТекущиеДанные[ИмяКолонки];
	ПараметрыФормы = Новый Структура;
	
	Если ИмяКолонки = "Время" Тогда
		Возврат;
	КонецЕсли;
	
	// сотрудника находим ещё кривее
	// хотя не вижу ситуаций когда 
	// такой код будет давать сбой
	
	// только для ДЕВЯТИ замерщиков
	// можно сделать бесконечное количество,
	// но пока вроде незачем :)
	НомерКолонки = Число(Прав(Поле.Имя,1))-1;
	Замерщик = СписокЗамерщиков.Получить(НомерКолонки).Значение;
	ДатаЗамера = Период + Час(Элемент.ТекущиеДанные["Время"]) * 60 * 60;
	
	// если ткнули по заполненному полю,
	// тогда открыть существующий замер
	
	Если ТипЗнч(ЗначениеЯчейки) = Тип("Строка") Тогда
		
		Если ЗначениеЯчейки <> "" Тогда
			// замер уже есть
			// только теперь нужно его найти :)
			ВыбранныйЗамер = ПолучитьЗамер(ДатаЗамера, Подразделение, Замерщик);
			ПараметрыФормы.Вставить("Ключ", ВыбранныйЗамер);
		Иначе
			// замера ещё нет
			Заполнение = Новый Структура;
			Заполнение.Вставить("ОбработкаЗаписьНаЗамер", Истина);
			Заполнение.Вставить("Замерщик", Замерщик);
			Заполнение.Вставить("ДатаЗамера", ДатаЗамера);
			Заполнение.Вставить("Подразделение", Подразделение);
			ПараметрыФормы.Вставить("Основание", Заполнение);
		КонецЕсли;
		ОткрытьФорму("Документ.Замер.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры // ПланВыборЗначения()

&НаСервереБезКонтекста
Функция ПолучитьЗамер(Период, Подразделение, Замерщик)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Замерщик", Замерщик);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГрафикВстречИЗамеровСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.ГрафикВстречИЗамеров.СрезПоследних(
	|			&Период,
	|			Подразделение = &Подразделение
	|				И Сотрудник = &Замерщик) КАК ГрафикВстречИЗамеровСрезПоследних";
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Регистратор;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Очень-очень странно, не найден документ замера для Подразделения: "
			+Подразделение+" Замерщик: "+Замерщик+" Период: "+Период;
		Сообщение.Сообщить();
	КонецЕсли;

КонецФункции // ПолучитьЗамер()

&НаСервере
Процедура ОчиститьРеквизиты()
	ЭлементДляУдаления = Элементы.Найти("План");
	Если Не ЭлементДляУдаления = Неопределено Тогда
		Элементы.Удалить(ЭлементДляУдаления);
	
		УдаляемыеРеквизиты = Новый Массив();
		УдаляемыеРеквизиты.Добавить("План");
		ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	КонецЕсли;
КонецПроцедуры // ОчиститьРеквизиты()

&НаСервере
Процедура ДобавитьКолонку(ИмяТаблицы, ИмяКолонки, ЗаголовокКолонки)
	НоваяКолонка = Элементы.Добавить(ИмяТаблицы + ИмяКолонки, Тип("ПолеФормы"), Элементы.План);
	НоваяКолонка.Заголовок = ЗаголовокКолонки;
	НоваяКолонка.ПутьКДанным = ИмяТаблицы + "." + ИмяКолонки;
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗамерщиковПриИзменении(Элемент)
	ИнициализироватьТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьЗамерщиков();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗамерщика(Команда)
	
	ФормаВыбора = ПолучитьФорму("Справочник.ФизическиеЛица.ФормаВыбора",, Элементы.СписокЗамерщиков);
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗамерщиковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если не ВыбранноеЗначение.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
		СписокЗамерщиков.Добавить(ВыбранноеЗначение);
		ИнициализироватьТЗ();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ЗаполнитьПлан();
	ЗаполнитьЗамерщиков(); // вдруг выбрали другого замерщика, кого нет в списке
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗамерщиков(Подразделение, Период)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ФизическиеЛица.Ссылка КАК Ссылка
	|	ИЗ
	|		Справочник.ФизическиеЛица КАК ФизическиеЛица
	|	ГДЕ
	|		ФизическиеЛица.ОсновнаяДолжность = ЗНАЧЕНИЕ(Справочник.Должности.СтаршийДизайнер)
	|		И ФизическиеЛица.Подразделение = &Подразделение
	|		И ФизическиеЛица.Активность
	|		И НЕ ФизическиеЛица.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Замер.Замерщик
	|	ИЗ
	|		Документ.Замер КАК Замер
	|	ГДЕ
	|		Замер.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Замер.Подразделение = &Подразделение) КАК Т";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период));
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
КонецФункции // ЗаполнитьЗамерщиков()

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьЗамерщиков();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗамерщиков()

	МассивЗамерщиков = ПолучитьЗамерщиков(Подразделение, Период);
	СписокЗамерщиков.Очистить();
	Для каждого ы Из МассивЗамерщиков Цикл
		СписокЗамерщиков.Добавить(ы);
	КонецЦикла;
	
	ИнициализироватьТЗ();

КонецПроцедуры // ЗаполнитьЗамерщиков()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Период = ТекущаяДата();
	Элементы.Подразделение.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокПодразделений());
	ЗаполнитьЗамерщиков();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПодразделений()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Подразделения.Ссылка
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	Подразделения.ВидПодразделения = ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Розница)";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ПолучитьСписокПодразделений()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Вставить содержимое обработчика.
КонецПроцедуры
